Repository: python/pootle-python-org-backup
Catalog: tmxes/pt/license.tmx
Source language: en
Languages: pt

source: History and License
pt: História e Licença

source: History of the software
pt: História do software

source: Python was created in the early 1990s by Guido van Rossum at Stichting Mathematisch Centrum (CWI, see http://www.cwi.nl/) in the Netherlands as a successor of a language called ABC. Guido remains Python's principal author, although it includes many contributions from others.
pt: Python foi criada no início dos anos 1990 por Guido van Rossum em Stichting Mathematisch Centrum (CWI, consulte http://www.cwi.nl/) na Holanda como um sucessor de uma linguagem chamada ABC. Guido continua sendo o autor principal do Python, ainda que inclua contribuições de muitos outros.

source: In 1995, Guido continued his work on Python at the Corporation for National Research Initiatives (CNRI, see http://www.cnri.reston.va.us/) in Reston, Virginia where he released several versions of the software.
pt: Em 1995, Guido continuou seu trabalho no Python na Corporation for National Research Initiatives (CNRI, consulte http://www.cnri.reston.va.us/) em Reston, Virginia onde ele lançou várias versões do software.

source: In May 2000, Guido and the Python core development team moved to BeOpen.com to form the BeOpen PythonLabs team. In October of the same year, the PythonLabs team moved to Digital Creations (now Zope Corporation; see http://www.zope.com/). In 2001, the Python Software Foundation (PSF, see http://www.python.org/psf/) was formed, a non-profit organization created specifically to own Python-related Intellectual Property. Zope Corporation is a sponsoring member of the PSF.
pt: Em maio de 2000, Guido e a equipe principal de desenvolvimento do Python se mudaram para o BeOpen.com para formar a equipe BeOpen PythonLabs. Em outubro do mesmo ano, a equipe PythonLabs mudou-se para a Digital Creations (atual Zope Corporation; consulte http://www.zope.com/). Em 2001, a Python Software Foundation (PSF, consulte http://www.python.org/psf/) foi formada, uma organização sem fins lucrativos criada especificamente para ter propriedade sobre a Propriedade Intelectual relacionada ao Python. A Zope Corporation é uma patrocinadora da PSF.

source: All Python releases are Open Source (see http://www.opensource.org/ for the Open Source Definition). Historically, most, but not all, Python releases have also been GPL-compatible; the table below summarizes the various releases.
pt: Todos as versões do Python são Open Source (consulte http://www.opensource.org/ para ver a definição de Open Source). Historicamente, a maioria, mas não todas, as versões do Python também têm sido compatíveis com a GPL; a tabela abaixo resume as várias versões.

source: Release
pt: Lançamento

source: Derived from
pt: Derivado de

source: Year
pt: Ano

source: Owner
pt: Proprietário

source: GPL compatible?
pt: Compatível com GPL?

source: 0.9.0 thru 1.2
pt: 0.9.0 até 1.2

source: yes
pt: sim

source: 1.3 thru 1.5.2
pt: 1.3 até 1.5.2

source: no
pt: não

source: GPL-compatible doesn't mean that we're distributing Python under the GPL. All Python licenses, unlike the GPL, let you distribute a modified version without making your changes open source. The GPL-compatible licenses make it possible to combine Python with other software that is released under the GPL; the others don't.
pt: GPL-compatível não significa que estamos distribuindo Python sob a GPL. Todas as licenças Python, ao contrário da GPL, permite você distribuir uma versão modificada sem fazer das suas alterações um código aberto. As licenças GPL-compatíveis tornam possível combinar Python com outro software que é distribuído sob a GPL; as outras não.

source: Thanks to the many outside volunteers who have worked under Guido's direction to make these releases possible.
pt: Obrigado aos vários voluntários exteriores que trabalharam sob a direção de Guido para tornar estes lançamentos possíveis.

source: Terms and conditions for accessing or otherwise using Python
pt: Termos e condições ao acessar ou utilizar de outra maneira Python
